import React from 'react';
import * as styles from './styles';

const About = () => {
    return (
        <div style={styles.rootStyles}>
            <h1 style={styles.titleStyles}>Компания ИНТЕРМЕХ</h1>

            <p>
                Мы предлагаем полный спектр решений по автоматизации технической
                подготовки производства, комплексно решая задачи организации единого
                информационного пространства предприятия.
            </p>

            <p>
                Наши продукты зарегистрированы в едином реестре программных продуктов
                ЕАЭС и сертифицированы во ФСТЭК по системе защиты информации.
            </p>

            <p style={styles.linkWrapperStyles}>
                <a href="#" style={styles.linkStyles}>
                    Перейти к решениям →
                </a>
            </p>

            <hr style={styles.dividerStyles} />

            <h2 style={styles.subtitleStyles}>О компании</h2>

            <p>Компания ИНТЕРМЕХ основана в 1990 году.</p>

            <p>
                Основной вид деятельности — разработка и внедрение систем автоматизации
                процессов конструкторской и технологической подготовки производства на
                машиностроительных, приборостроительных предприятиях, а также
                информационная поддержка проектирования в промышленном и гражданском
                строительстве.
            </p>

            <p>
                Применение наших решений позволяет предприятиям значительно повысить
                эффективность, сократить сроки и стоимость технической подготовки
                производства.
            </p>

            <hr style={styles.dividerStyles} />

            <h2 style={styles.subtitleStyles}>Разработчик, Поставщик, Внедренец</h2>

            <p>
                ИНТЕРМЕХ предоставляет различные сервисы по внедрению систем
                автоматизации и вводу их в промышленную эксплуатацию на предприятиях.
                Следовательно, вы работаете с разработчиком, поставщиком и внедренцем
                в одном лице.
            </p>

            <p>
                С целью повышения качества предоставляемых услуг по продаже и
                сопровождению наших программных продуктов мы поддерживаем и постоянно
                развиваем сеть дилерских и учебных центров в различных регионах России
                и странах СНГ. Технические специалисты компаний-партнеров проходят
                ежегодную аттестацию в нашем учебном центре и в полной мере владеют
                знаниями, необходимыми для внедрения и сопровождения наших решений.
            </p>
        </div>
    );
};

export default About;